In [1]:
import pandas as pd

# 문제1. user_id를 인덱스로 사용한 데이터프레임 읽기

In [139]:
df = pd.read_csv("./data/occupation.tsv", sep = "|", index_col = "user_id")
df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

# 문제2. 각 occupation별 age의 평균 구하기

In [132]:
occupation_group = df.groupby("occupation")

In [98]:
occupation_group["age"].mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

# 문제3. 각 occupation 별 남자의 비율 구하기
- 단, 남자 비율의 내림차순으로 정렬하여 출력하기

In [140]:
def gender_int(x):
    if x == "M":
        return 1
    
    return 0

In [141]:
df["gender"] = df["gender"].map(gender_int)

In [133]:
df["gender"] = df["gender"].map(lambda x: 1 if x == "M" else 0)

In [100]:
df["gender"] = df["gender"].str.replace("M", 1)
df["gender"] = df["gender"].str.replace("F", 0)
df.dtypes

age            int64
gender         int32
occupation    object
zip_code      object
dtype: object

In [135]:
df.head()

         age  gender  occupation zip_code
user_id
1         24       1  technician    85711
2         53       0       other    94043
3         23       1      writer    32067
4         24       1  technician    43537
5         33       0       other    15213

In [142]:
occupation_group["gender"].mean().sort_values(ascending = False)

occupation
doctor           1.000000
engineer         0.970149
technician       0.962963
retired          0.928571
programmer       0.909091
executive        0.906250
scientist        0.903226
entertainment    0.888889
lawyer           0.833333
salesman         0.750000
educator         0.726316
student          0.693878
other            0.657143
marketing        0.615385
writer           0.577778
none             0.555556
administrator    0.544304
artist           0.535714
librarian        0.431373
healthcare       0.312500
homemaker        0.142857
Name: gender, dtype: float64

In [106]:
gender_ratio = occupation_group["gender"].sum()/occupation_group["gender"].count()

In [107]:
gender_ratio.sort_values(ascending = False)

occupation
doctor           1.000000
engineer         0.970149
technician       0.962963
retired          0.928571
programmer       0.909091
executive        0.906250
scientist        0.903226
entertainment    0.888889
lawyer           0.833333
salesman         0.750000
educator         0.726316
student          0.693878
other            0.657143
marketing        0.615385
writer           0.577778
none             0.555556
administrator    0.544304
artist           0.535714
librarian        0.431373
healthcare       0.312500
homemaker        0.142857
Name: gender, dtype: float64

# 문제4. occupation별 age의 최솟값, 최댓값 구하기

In [82]:
occupation_age = occupation_group["age"].agg(["min", "max"])
occupation_age

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

# 문제5. 각 occupation의 gender별 평균 age를 구하기

In [84]:
occupation_gender = df.groupby(["occupation", "gender"])

In [89]:
gender_age = occupation_gender["age"].mean()

In [92]:
gender_age

occupation     gender
administrator  0         40.638889
               1         37.162791
artist         0         30.307692
               1         32.333333
doctor         1         43.571429
educator       0         39.115385
               1         43.101449
engineer       0         29.500000
               1         36.600000
entertainment  0         31.000000
               1         29.000000
executive      0         44.000000
               1         38.172414
healthcare     0         39.818182
               1         45.400000
homemaker      0         34.166667
               1         23.000000
lawyer         0         39.500000
               1         36.200000
librarian      0         40.000000
               1         40.000000
marketing      0         37.200000
               1         37.875000
none           0         36.500000
               1         18.600000
other          0         35.472222
               1         34.028986
programmer     0         32.166667
               1         33.216667
retired        0         70.000000
               1         62.538462
salesman       0         27.000000
               1         38.555556
scientist      0         28.333333
               1         36.321429
student        0         20.750000
               1         22.669118
technician     0         38.000000
               1         32.961538
writer         0         37.631579
               1         35.346154
Name: age, dtype: float64

In [143]:
df.groupby(["occupation", "gender"])["age"].mean()

occupation     gender
administrator  0         40.638889
               1         37.162791
artist         0         30.307692
               1         32.333333
doctor         1         43.571429
educator       0         39.115385
               1         43.101449
engineer       0         29.500000
               1         36.600000
entertainment  0         31.000000
               1         29.000000
executive      0         44.000000
               1         38.172414
healthcare     0         39.818182
               1         45.400000
homemaker      0         34.166667
               1         23.000000
lawyer         0         39.500000
               1         36.200000
librarian      0         40.000000
               1         40.000000
marketing      0         37.200000
               1         37.875000
none           0         36.500000
               1         18.600000
other          0         35.472222
               1         34.028986
programmer     0         32.166667
               1         33.216667
retired        0         70.000000
               1         62.538462
salesman       0         27.000000
               1         38.555556
scientist      0         28.333333
               1         36.321429
student        0         20.750000
               1         22.669118
technician     0         38.000000
               1         32.961538
writer         0         37.631579
               1         35.346154
Name: age, dtype: float64